; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        ; (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=9, locations=11, max_capacity=2, out_folder=training/easy, instance_id=53, seed=94

(define (problem transport-53)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l1)
    (at p2 l11)
    (at p3 l8)
    (at p4 l6)
    (at p5 l5)
    (at p6 l7)
    (at p7 l10)
    (at p8 l5)
    (at p9 l9)
    (at v1 l1)
    (at v2 l7)
    (at v3 l1)
    (at v4 l7)
    (at v5 l6)
    (road l3 l1)
    (road l5 l7)
    (road l5 l10)
    (road l11 l2)
    (road l9 l11)
    (road l1 l3)
    (road l2 l11)
    (road l7 l4)
    (road l6 l5)
    (road l5 l6)
    (road l4 l8)
    (road l10 l5)
    (road l10 l11)
    (road l11 l10)
    (road l4 l7)
    (road l3 l11)
    (road l8 l4)
    (road l11 l3)
    (road l11 l9)
    (road l7 l5)
    (road l4 l6)
    (road l6 l4)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l7)
    (at p3 l4)
    (at p4 l11)
    (at p5 l7)
    (at p6 l3)
    (at p7 l9)
    (at p8 l11)
    (at p9 l10))))

; plan
1. (pick-up v1 l1 p1 c0 c1)
   deleted: (at p1 l1) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 9
2. (drive v1 l1 l3)
   deleted: (at v1 l1)
   added: (at v1 l3)
   goals met: 0 of 9
3. (drive v1 l3 l11)
   deleted: (at v1 l3)
   added: (at v1 l11)
   goals met: 0 of 9
4. (drive v1 l11 l9)
   deleted: (at v1 l11)
   added: (at v1 l9)
   goals met: 0 of 9
5. (drop v1 l9 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l9) (capacity v1 c1)
   goals met: 1 of 9
6. (drive v1 l9 l11)
   deleted: (at v1 l9)
   added: (at v1 l11)
   goals met: 1 of 9
7. (pick-up v1 l11 p2 c0 c1)
   deleted: (at p2 l11) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 9
8. (drive v1 l11 l10)
   deleted: (at v1 l11)
   added: (at v1 l10)
   goals met: 1 of 9
9. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 1 of 9
10. (drive v1 l5 l7)
   deleted: (at v1 l5)
   added: (at v1 l7)
   goals met: 1 of 9
11. (drop v1 l7 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l7) (capacity v1 c1)
   goals met: 2 of 9
12. (drive v1 l7 l4)
   deleted: (at v1 l7)
   added: (at v1 l4)
   goals met: 2 of 9
13. (drive v1 l4 l8)
   deleted: (at v1 l4)
   added: (at v1 l8)
   goals met: 2 of 9
14. (pick-up v1 l8 p3 c0 c1)
   deleted: (at p3 l8) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 9
15. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 2 of 9
16. (drop v1 l4 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l4) (capacity v1 c1)
   goals met: 3 of 9
17. (drive v1 l4 l6)
   deleted: (at v1 l4)
   added: (at v1 l6)
   goals met: 3 of 9
18. (pick-up v1 l6 p4 c0 c1)
   deleted: (at p4 l6) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 9
19. (drive v1 l6 l5)
   deleted: (at v1 l6)
   added: (at v1 l5)
   goals met: 3 of 9
20. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 3 of 9
21. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 3 of 9
22. (drop v1 l11 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l11) (capacity v1 c1)
   goals met: 4 of 9
23. (drive v1 l11 l10)
   deleted: (at v1 l11)
   added: (at v1 l10)
   goals met: 4 of 9
24. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 4 of 9
25. (pick-up v1 l5 p5 c0 c1)
   deleted: (at p5 l5) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 9
26. (drive v1 l5 l7)
   deleted: (at v1 l5)
   added: (at v1 l7)
   goals met: 4 of 9
27. (drop v1 l7 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l7) (capacity v1 c1)
   goals met: 5 of 9
28. (pick-up v1 l7 p6 c0 c1)
   deleted: (at p6 l7) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 9
29. (drive v1 l7 l5)
   deleted: (at v1 l7)
   added: (at v1 l5)
   goals met: 5 of 9
30. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 5 of 9
31. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 5 of 9
32. (drive v1 l11 l3)
   deleted: (at v1 l11)
   added: (at v1 l3)
   goals met: 5 of 9
33. (drop v1 l3 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l3) (capacity v1 c1)
   goals met: 6 of 9
34. (drive v1 l3 l11)
   deleted: (at v1 l3)
   added: (at v1 l11)
   goals met: 6 of 9
35. (drive v1 l11 l10)
   deleted: (at v1 l11)
   added: (at v1 l10)
   goals met: 6 of 9
36. (pick-up v1 l10 p7 c0 c1)
   deleted: (at p7 l10) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 9
37. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 6 of 9
38. (drive v1 l11 l9)
   deleted: (at v1 l11)
   added: (at v1 l9)
   goals met: 6 of 9
39. (drop v1 l9 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l9) (capacity v1 c1)
   goals met: 7 of 9
40. (drive v1 l9 l11)
   deleted: (at v1 l9)
   added: (at v1 l11)
   goals met: 7 of 9
41. (drive v1 l11 l10)
   deleted: (at v1 l11)
   added: (at v1 l10)
   goals met: 7 of 9
42. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 7 of 9
43. (pick-up v1 l5 p8 c0 c1)
   deleted: (at p8 l5) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 9
44. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 7 of 9
45. (drive v1 l10 l11)
   deleted: (at v1 l10)
   added: (at v1 l11)
   goals met: 7 of 9
46. (drop v1 l11 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l11) (capacity v1 c1)
   goals met: 8 of 9
47. (drive v1 l11 l9)
   deleted: (at v1 l11)
   added: (at v1 l9)
   goals met: 8 of 9
48. (pick-up v1 l9 p9 c0 c1)
   deleted: (at p9 l9) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 9
49. (drive v1 l9 l11)
   deleted: (at v1 l9)
   added: (at v1 l11)
   goals met: 8 of 9
50. (drive v1 l11 l10)
   deleted: (at v1 l11)
   added: (at v1 l10)
   goals met: 8 of 9
51. (drop v1 l10 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l10) (capacity v1 c1)
   goals met: 9 of 9
